#include <stdio.h>
#include <stdlib.h>
#include <math.h>
float PI=3.14159265359;

/*construct a structure of BMP header*/
typedef struct Bmpheader{
    unsigned short identifier; // 0x0000
    unsigned int filesize; // 0x0002
    unsigned short reserved; // 0x0006
    unsigned short reserved2;
    unsigned int bitmap_dataoffset; // 0x000A
    unsigned int bitmap_headersize; // 0x000E
    unsigned int width; // 0x0012
    unsigned int height; // 0x0016
    unsigned short planes; // 0x001A
    unsigned short bits_perpixel; // 0x001C
    unsigned int compression; // 0x001E
    unsigned int bitmap_datasize; // 0x0022
    unsigned int hresolution; // 0x0026
    unsigned int vresolution; // 0x002A
    unsigned int usedcolors; // 0x002E
    unsigned int importantcolors; // 0x0032
    unsigned int palette; // 0x0036
} Bitmap;

/*construct a structure of RGB*/
typedef struct RGB{
    int R;
    int G;
    int B;
} ImgRGB;

typedef struct YIQ{
    float Y;
    float I;
    float Q;
} ImgYIQ;
typedef struct DCT_YIQ{
    int Y;
    int I;
    int Q;
} DCT_YIQ;
typedef struct data_zig{
    int num;
    int count;
    int code[30];
    int len;
} data_zig;


void inverse_zig(int *data_Y, int *data_I, int *data_Q, int size_Y, int size_I, int size_Q, Bitmap bmpheader);
Bitmap readheader(FILE* fp);
ImgRGB** malloc_2D(int row, int col);
ImgYIQ** malloc_2D_YIQ(int row, int col);
DCT_YIQ** malloc_2D_DCT_YIQ(int row, int col);
void InputData(FILE* fp,ImgRGB **array,int H,int W);
void output_bmp(ImgRGB **RGB,FILE* outfile,Bitmap bmpheader);
void output_bmp_YIQ(ImgYIQ **YIQ,FILE* outfile,Bitmap bmpheader);
void convert_YIQ(ImgRGB **RGB, ImgYIQ **YIQ, int row, int col);
void inverse_YIQ(ImgRGB **RGB, ImgYIQ **YIQ, int row, int col);
